Revit 2022 API
IFCAnyHandle Methods
The IFCAnyHandle type exposes the following members.
Methods
Name | Description
CreateAggregateAttribute
 Creates an attribute that is an aggregate.
Delete
 Deletes the handle.
Dispose
Equals
 Determines whether the specified Object is equal to the current Object.
 (Overrides Object.Equals(Object).)
GetAttribute
 Gets the attribute by name.
GetHashCode
 Gets the integer value of the id as hash code
 (Overrides Object.GetHashCode().)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsSubTypeOf
 Determines whether the instance is an instance of the specified instance type or a subtype of this instance type.
IsTypeOf
 Determines whether the instance is an instance of exactly the specified instance type.
SetAttribute(String, IFCAnyHandle)
 Sets the attribute value.
SetAttribute(String, IFCData)
 Sets the attribute value.
SetAttribute(String, Boolean)
 Sets the attribute value.
SetAttribute(String, IList<IFCAnyHandle>)
SetAttribute(String, IList<Boolean>)
SetAttribute(String, IList<Double>)
SetAttribute(String, IList<Int32>)
SetAttribute(String, IList<String>)
SetAttribute(String, ISet<IFCAnyHandle>)
SetAttribute(String, ISet<Boolean>)
SetAttribute(String, ISet<Double>)
SetAttribute(String, ISet<Int32>)
SetAttribute(String, ISet<String>)
SetAttribute(String, Double)
 Sets the attribute value.
SetAttribute(String, Int32)
 Sets the attribute value.
SetAttribute(String, String)
 Sets the attribute value.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Unset
 Clears the handle.
UnsetAttribute
 Unsets the attribute value.
See Also
IFCAnyHandle Class
Autodesk.Revit.DB.IFC Namespace